Repository: digi21/DigiNG.Commands
Catalog: DigiNG.Commands/Recursos.*.resx
Languages: es_es

# CopiarAtributosBBDDName
source: copy_database_attributes
es_es: copiar_atributos_bbdd

# CopiarNombreCódigoName
source: copy_code_name
es_es: copiar_nombre_codigo

# CopiarTablaRegistroName
source: copy_table_registr
es_es: copiar_tabla_registro

# CortarName
source: cut
es_es: cortar

# CortarPoligonoName
source: cut_polygon
es_es: cortar_poligono

# DetectaLíneasPerímetroInferiorAValorName
source: detect_lines_perimeter_lower
es_es: detectar_lineas_perimetro_inferior

# DetectarUndershootName
source: detect_undershoot
es_es: detectar_undershoot

# HasSeleccionadoUnaEntidadConMasDeUnCodigoEstaOrdenNoEstaPreparada
source: You have chosen an entity with more than one code. This order is not yet prepared for this scenario.
es_es: Has seleccionado una entidad con más de un código. Esta orden aún no está preparada para este escenario.

# LaEntidadOrigenYDestinoNoTienenCódigosComunes
source: Source and destination entities does not have common codes
es_es: Las entidades origen y destino no tienen códigos comunes

# LaEntidadQueHasSeleccionadoNoTieneNingúnEnlaceDeBaseDatos
source: The source and destination entities have no common codes
es_es: La entidad que has seleccionado no tiene ningún enlace de base de datos.

# LineaAPolígonoDescription
source: Transforms lines to polygons. It is necessary to introduce codes of (closed) lines as parameters to transform into polygon. You can put multiple parameters and wildcards are also supported.
es_es: Transforma líneas en polígonos. Es necesario introducir como parámetros los códigos de las líneas (cerradas) a transformar en polígono. Se pueden poner varios parámetros y además se admiten comodines.

# LineaAPolígonoName
source: line_to_polygon
es_es: linea_a_poligono

# LineaXConPerímetroYInferiorAZ
source: Line ({0}) with perimeter: {1} lower than {2}
es_es: Línea ({0}) con perímetro: {1} inferior a {2}

# LocalizadoUndershootEnLaLíneaConCódigoX
source: Located undershoot in line with code {0}
es_es: Localizado undershoot en la línea con código {0}

# LosCódigosDeLasEntidadesSonDistintosYPoLoTantoNoSePuedenUnir
source: The codes of the entities are different, so it cannot be joined
es_es: Los códigos de las entidades son distintos, por lo tanto no se pueden unir

# MagnitudX
source: Magnitude {0}
es_es: Magnitud {0}

# NoHaIndicadoLosCódigosDeLasLíneasAConvertirEnPolígono
source: You have not specified the codes of the lines to convert to polygon
es_es: No ha indicado los códigos de las líneas a convertir a polígono

# PartirPoligonosName
source: cut_polygons
es_es: partir_poligonos

# RecortarPoligonoName
source: trim_polygon
es_es: recortar_poligono

# RecortarPoligonosName
source: trim_polygons
es_es: recortar_poligonos

# SeleccionaElPoligonoACortar
source: Select the polygon to be cut
es_es: Selecciona el polígono a cortar

# SeleccionaElPolígonoARecortar
source: Select the polygon to be trimmed
es_es: Selecciona el polígono a recortar

# SeleccionaElPrimerPolígnoAUnir
source: Select the polygon to be joined
es_es: Selecciona el primer polígono a unir

# SeleccionaElSegundoPolígonoAUnir
source: Select the second polygon to join
es_es: Selecciona el segundo polígono a unir

# SeleccionaLaEntidadDestino
source: Select the destination entity...
es_es: Selecciona la entidad destino...

# SeleccionaLaEntidadOrigen
source: Select the origin entity...
es_es: Selecciona la entidad origen...

# SeleccionaLaLíneaDeCorte
source: Select the cutting line
es_es: Selecciona la línea de corte

# SeleccionaLaLíneaLímite
source: Select the limit line
es_es: Selecciona la línea de límite

# SeleccionaLíneaATramificar
source: Select the line to cut
es_es: Selecciona la línea a tramificar

# SePartieronXEntidadesYSeFormaronYEntidadesNuevas
source: {0} entities was cutted and {1} entities was formed
es_es: Se partieron {0} entidades y se formaron {1} entidades nuevas

# TramificaInsertandoEntidadSeleccionadaName
source: insert_vertex_selected_entity
es_es: tram_inserta_vertices_entidad_sel

# UnirPolígonosName
source: join_polygons
es_es: unir_poligonos

# CambCodManteniendoAtributosName
source: change_code_keeping_attributes
es_es: camb_cod_manteniendo_atributos

# CambCodManteniendoAtributosTitle
source: Change code while maintaining attributes
es_es: Cambia código manteniendo atributos

# CopiarAtributosBBDDTitle
source: Copy database attributes
es_es: Copiar atributos de bbdd

# CopiarNombreCódigoTitle
source: Copy code name maintaining attributes
es_es: Copiar nombre de código manteniendo atributos

# CopiarTablaRegistroTitle
source: Copy code table/record keeping name
es_es: Copiar tabla/registro de código manteniendo nombre

# CortarPoligonoTitle
source: Cut polygon
es_es: Cortar polígono

# CortarTitle
source: Cut
es_es: Cortar

# PartirPoligonosTitle
source: Cut polygons
es_es: Partir polígonos

# RecortarPoligonosTitle
source: Trim polygons
es_es: Recortar polígonos

# RecortarPoligonoTitle
source: Trim polygon
es_es: Recortar polígono

# TramificaInsertandoEntidadSeleccionadaTitle
source: Insert vertices at the intersections of the selected line
es_es: Insertar vértices en las intersecciones de la línea seleccionada

# UnirPolígonosTitle
source: Join polygons
es_es: Unir polígonos
